20250707101640-lesson_2_form_agile_teams_as_an_agile_release_train.org
:PROPERTIES:
:ID:       11505177-1dcf-4a55-bf5e-e3017c369efb
:END:
#+title: Lesson 2 Form Agile Teams as an Agile Release Train
#+filetags: :SAFe

* 2.1 Forming cross-functional Agile Teams
Ten or fewer individuals who define build, test and deliver value in short increments while continuously learning and adjusting.

Optimized for communication and delivery of value
Deliver value every two weeks
Contain two speciality roles (Scrum Master / Team Coach and Product Owner)

** Characteristics of high performing Agile Teams
Psychological safety needed to take risks without fear of embarrassment of punishment
Have diverse knowledge and skills to make quick effective decisions independently
Truest each other (Healthy conflict and reliance on others)
Align on a shared vision with clear goals and purpose
Accountable to each other and the organization
Meet commitments

*** Topogolies
**** 1. Stream-aligned team
Organized around flow of work and can deliver value directly to the customer / end user

**** 2. Platform team
Organized around development and support of platforms that provide services to other teams

**** 3. Enabling team

**** 4. Complicated subsystem team
Organized around specific subsystems that require deep knowledge

* 2.2. Scrum Master / Team Coach and Product Owner
** Scrum Master
- Facilitates PI Planning
- supports iteration execution
- Imporves flow
- Builds a high performing team
- Improves ART Performance

** Product Owner
- Connects with customer
- Contributes to vision and roadmap
- Manages and prioritizes the team backlog
- Supports the team in delivering value
- Getting and applying feedback

* 2.3 SAFe Scrum and SAFe Team Kanban
** SAFe Scrum
- Great for new technology solution teams
  Provides known methods for team alignment via Scrum events
  Creates shared team commitment to timeboxed goals

** SAFe Kanban
- Great for new business solution teams
- Provides daily ability to react to changing demands
- Creates priority alignment and next to pull backlog

* 2.4 Becoming an Agile Release Train
Virtual org of 5 - 12 teams (50 - 125 people)
Synchronized on a common cadence, a Planning Interval (PI)
Aligned to a common mission via a single ART Backlog

** Roles on the ART
*** Release Train engineer
Acts as chief coach for train

*** System Architect
Provides architectural guidance and technical enablement to the teams on the train

*** Business Owners
Key stakeholders on the ART

*** Product Management
Owns defines and prioritizes ART Backlog

*** System Team
Provides processses and tools to integrate and evaluate assets early and often

** Responsibilities of ART
Improve relentlessly
Connect with the customer
Get feedback
Plan the work
Delivery value
