20250707101640-lesson_2_form_agile_teams_as_an_agile_release_train.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lesson 2 Form Agile Teams as an Agile Release Train</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lesson 2 Form Agile Teams as an Agile Release Train</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org83b28f4">1. 2.1 Forming cross-functional Agile Teams</a>
<ul>
<li><a href="#org6c85fa9">1.1. Characteristics of high performing Agile Teams</a>
<ul>
<li><a href="#org114ff86">1.1.1. Topogolies</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga755e6d">2. 2.2. Scrum Master / Team Coach and Product Owner</a>
<ul>
<li><a href="#orgf04cf63">2.1. Scrum Master</a></li>
<li><a href="#org2b01961">2.2. Product Owner</a></li>
</ul>
</li>
<li><a href="#orgd45e9ee">3. 2.3 SAFe Scrum and SAFe Team Kanban</a>
<ul>
<li><a href="#org9843fe9">3.1. SAFe Scrum</a></li>
<li><a href="#org1b76f6d">3.2. SAFe Kanban</a></li>
</ul>
</li>
<li><a href="#orgc7aeeab">4. 2.4 Becoming an Agile Release Train</a>
<ul>
<li><a href="#org8db8aaf">4.1. Roles on the ART</a>
<ul>
<li><a href="#orgd3c56f0">4.1.1. Release Train engineer</a></li>
<li><a href="#org43f1aa5">4.1.2. System Architect</a></li>
<li><a href="#orgab53f79">4.1.3. Business Owners</a></li>
<li><a href="#orgf813bac">4.1.4. Product Management</a></li>
<li><a href="#org14cafcb">4.1.5. System Team</a></li>
</ul>
</li>
<li><a href="#org5cc1821">4.2. Responsibilities of ART</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org83b28f4" class="outline-2">
<h2 id="org83b28f4"><span class="section-number-2">1.</span> 2.1 Forming cross-functional Agile Teams</h2>
<div class="outline-text-2" id="text-1">
<p>
Ten or fewer individuals who define build, test and deliver value in short increments while continuously learning and adjusting.
</p>

<p>
Optimized for communication and delivery of value
Deliver value every two weeks
Contain two speciality roles (Scrum Master / Team Coach and Product Owner)
</p>
</div>

<div id="outline-container-org6c85fa9" class="outline-3">
<h3 id="org6c85fa9"><span class="section-number-3">1.1.</span> Characteristics of high performing Agile Teams</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Psychological safety needed to take risks without fear of embarrassment of punishment
Have diverse knowledge and skills to make quick effective decisions independently
Truest each other (Healthy conflict and reliance on others)
Align on a shared vision with clear goals and purpose
Accountable to each other and the organization
Meet commitments
</p>
</div>

<div id="outline-container-org114ff86" class="outline-4">
<h4 id="org114ff86"><span class="section-number-4">1.1.1.</span> Topogolies</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="orgee1c6a8"></a>1. Stream-aligned team<br />
<div class="outline-text-5" id="text-1-1-1-1">
<p>
Organized around flow of work and can deliver value directly to the customer / end user
</p>
</div>
</li>

<li><a id="org4c4a550"></a>2. Platform team<br />
<div class="outline-text-5" id="text-1-1-1-2">
<p>
Organized around development and support of platforms that provide services to other teams
</p>
</div>
</li>

<li><a id="org788ae43"></a>3. Enabling team<br /></li>

<li><a id="orga26102f"></a>4. Complicated subsystem team<br />
<div class="outline-text-5" id="text-1-1-1-4">
<p>
Organized around specific subsystems that require deep knowledge
</p>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orga755e6d" class="outline-2">
<h2 id="orga755e6d"><span class="section-number-2">2.</span> 2.2. Scrum Master / Team Coach and Product Owner</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf04cf63" class="outline-3">
<h3 id="orgf04cf63"><span class="section-number-3">2.1.</span> Scrum Master</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Facilitates PI Planning</li>
<li>supports iteration execution</li>
<li>Imporves flow</li>
<li>Builds a high performing team</li>
<li>Improves ART Performance</li>
</ul>
</div>
</div>

<div id="outline-container-org2b01961" class="outline-3">
<h3 id="org2b01961"><span class="section-number-3">2.2.</span> Product Owner</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Connects with customer</li>
<li>Contributes to vision and roadmap</li>
<li>Manages and prioritizes the team backlog</li>
<li>Supports the team in delivering value</li>
<li>Getting and applying feedback</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd45e9ee" class="outline-2">
<h2 id="orgd45e9ee"><span class="section-number-2">3.</span> 2.3 SAFe Scrum and SAFe Team Kanban</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9843fe9" class="outline-3">
<h3 id="org9843fe9"><span class="section-number-3">3.1.</span> SAFe Scrum</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Great for new technology solution teams
Provides known methods for team alignment via Scrum events
Creates shared team commitment to timeboxed goals</li>
</ul>
</div>
</div>

<div id="outline-container-org1b76f6d" class="outline-3">
<h3 id="org1b76f6d"><span class="section-number-3">3.2.</span> SAFe Kanban</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Great for new business solution teams</li>
<li>Provides daily ability to react to changing demands</li>
<li>Creates priority alignment and next to pull backlog</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc7aeeab" class="outline-2">
<h2 id="orgc7aeeab"><span class="section-number-2">4.</span> 2.4 Becoming an Agile Release Train</h2>
<div class="outline-text-2" id="text-4">
<p>
Virtual org of 5 - 12 teams (50 - 125 people)
Synchronized on a common cadence, a Planning Interval (PI)
Aligned to a common mission via a single ART Backlog
</p>
</div>

<div id="outline-container-org8db8aaf" class="outline-3">
<h3 id="org8db8aaf"><span class="section-number-3">4.1.</span> Roles on the ART</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgd3c56f0" class="outline-4">
<h4 id="orgd3c56f0"><span class="section-number-4">4.1.1.</span> Release Train engineer</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Acts as chief coach for train
</p>
</div>
</div>

<div id="outline-container-org43f1aa5" class="outline-4">
<h4 id="org43f1aa5"><span class="section-number-4">4.1.2.</span> System Architect</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Provides architectural guidance and technical enablement to the teams on the train
</p>
</div>
</div>

<div id="outline-container-orgab53f79" class="outline-4">
<h4 id="orgab53f79"><span class="section-number-4">4.1.3.</span> Business Owners</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Key stakeholders on the ART
</p>
</div>
</div>

<div id="outline-container-orgf813bac" class="outline-4">
<h4 id="orgf813bac"><span class="section-number-4">4.1.4.</span> Product Management</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
Owns defines and prioritizes ART Backlog
</p>
</div>
</div>

<div id="outline-container-org14cafcb" class="outline-4">
<h4 id="org14cafcb"><span class="section-number-4">4.1.5.</span> System Team</h4>
<div class="outline-text-4" id="text-4-1-5">
<p>
Provides processses and tools to integrate and evaluate assets early and often
</p>
</div>
</div>
</div>

<div id="outline-container-org5cc1821" class="outline-3">
<h3 id="org5cc1821"><span class="section-number-3">4.2.</span> Responsibilities of ART</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Improve relentlessly
Connect with the customer
Get feedback
Plan the work
Delivery value
</p>
</div>
</div>
</div>
</div>
</body>
</html>
